/*
1461 C.Случайные события

Рон — счастливый обладатель перестановки a длины n.
Перестановкой длины n является массив, состоящий из n различных целых чисел от 1 до n в произвольном порядке. Над перестановкой Рона ставится m экспериментов следующего вида: (ri, pi). Это обозначает, что элементы в диапазоне [1,ri] будут отсортированы в возрастающем порядке с вероятностью pi. 
Требуется определить, с какой вероятностью перестановка станет полностью отсортированной по возрастанию после m экспериментов.

*/
#include <stdio.h>

const int N = 2e5+10;

typedef struct couple{
    int r;//длина префикса
    double p;//вероятность отсортировки
} pair;

void solve(){
    pair p[N];
    int n, m;//количество элементов и экспериментов
    scanf("%d %d\n", &n, &m);
    int a[N];
    for(int i = 1; i <= n; i++){
        scanf("%d ", &a[i]);//описание перестановок    
    }
    for(int i = 1; i <= m; i++){
        scanf("%d %le\n", &p[i].r, &p[i].p);
    }
    int flag = 0;
    for(int i = n; i >= 1; i--){
        if(i != a[i]){
            flag = i;
            break;
        }
    }
	double ans = 1.0;
	if(flag == 0){
        printf("%.6f\n", ans);
        return;
    }
	for(int i = 1;i <= m;i++){
		if(p[i].r >= flag){
			ans *= (1.0 - p[i].p);
		}
	}
	printf("%.6f\n", (1.0 - ans));
}

int main() {
    int t;//количество наборов входных данных
    scanf("%d\n", &t);
    for(int i = t; i > 0; i--){
        solve();
    }
    return 0;
}
        
            
